#+TITLE: Morse Project Presentation Prep
#+AUTHOR: Matthew Younger
#+DATE: 2025-11-18

#+STARTUP: indent overview hideblocks entitiespretty
#+PROPERTY: header-args:elisp :results output
#+PROPERTY: header-args:R :session *R* :results output
#+PROPERTY: header-args:python :noweb yes :comments noweb :results output
#+PROPERTY: header-args:cpp :noweb yes :comments noweb :results output
#+PROPERTY: header-args:sh :results silent

:ELISP-HELPERS:
Org Customizations
#+name: Emacs tweaks
#+begin_src elisp
(+org-pretty-mode t)
(flyspell-mode 0)
(org-mode-restart) ;; Ensures the headers get read if created from template.
#+end_src

Tangle =functions.org= for use in this project, also:
#+name: tangle functions.org
#+begin_src elisp
(org-babel-tangle-file "../functions.org" "./presentation/R/project_functions.R")
#+end_src

#+RESULTS:
| /home/matthew/playground/morse-project/R/project_functions.R | /home/matthew/playground/morse-project/presentation/R/project_functions.R |

These will be used to permanently hold the illustrations for the presentation.
#+name: Create plots directories
#+begin_src bash
mkdir -p ./img
#+end_src

Adjusted to the subdir for the presentation:
#+name: initialize R
#+begin_src R
# Get and set the working directory:
paste0(Sys.getenv("MORSE_ROOT"), "presentation/") -> projectRoot
setwd(projectRoot)
#+end_src

#+name: import dependencies
#+begin_src R
source("R/project_functions.R")
library(seewave)
library(tuneR)
#+end_src

Project Cleanup
#+name: Project Cleanup Interactive
#+begin_src elisp :results silent
(defun +temp/cleanup-this-project ()
  "Cleans up trivial/generated project files"
  (interactive) ;; make this available with M-x
  (+org/remove-result-blocks 0) ;; remove result blocks back to the beginning...
  (delete-directory project-dir t) ;; delete src directory
  (delete-directory "R" t) ;; Delete R functions derived from one dir up.
  (delete-directory "img" t)) ;; Delete the img folder
  #+end_src

Tangle all files automatically
#+name: Tangle All Blocks
#+begin_src elisp
;; It's nice if when calling org-babel-execute-buffer, that includes tangling all my files...
(org-babel-tangle) ;; tangle everything as a last step...
#+end_src

:END:

